In [ ]:
USE spartaserver

Create trainers table

In [ ]:
DROP TABLE IF EXISTS trainers
CREATE TABLE trainers(
    id VARCHAR(225) PRIMARY KEY,
    name VARCHAR(225),
    email VARCHAR(225),
    phone_number CHAR(11),
);

Insert values in trainers table

In [ ]:
INSERT INTO trainers (
    id,name ,email,phone_number
) VALUES
('t1','David','d@spartaglobal.com','07467289176'),
('t2','Alan','a@spartaglobal.com','07294092578'),
('t3','Paula','p@spartaglobal.com','07120989092');

In [ ]:
SELECT * FROM trainers;

Create modules table

In [ ]:
DROP TABLE IF EXISTS modules
CREATE TABLE modules (
    id VARCHAR(225) PRIMARY KEY,
    name VARCHAR(225)
);

Insert values into modules table

In [ ]:
INSERT INTO modules (
    id,name
) VALUES
('m1','Data'),
('m2','Development'),
('m3','Business intelligence');

Create courses table

In [ ]:
DROP TABLE IF EXISTS courses
CREATE TABLE courses (
    id VARCHAR(225) PRIMARY KEY,
    name VARCHAR(225),
    trainer_id VARCHAR(225) FOREIGN KEY REFERENCES trainers(id),
    module_id VARCHAR(225) FOREIGN KEY REFERENCES modules(id)
);

Insert values into course table

In [ ]:
INSERT INTO courses (
    id,name ,trainer_id,module_id
) VALUES
('c1','Data engineering','t2','m1'),
('c2','Java Development','t1','m2'),
('c3','Data analyst','t3','m3');

Create peoples table

In [ ]:
DROP TABLE IF EXISTS peoples
CREATE TABLE peoples (
    id INT PRIMARY KEY,
    name VARCHAR(225),
    status VARCHAR(225),
    email VARCHAR(225),
    phone_number CHAR(11),
    course_id VARCHAR(225) FOREIGN KEY REFERENCES courses(id)
);

Insert values into table peoples

In [ ]:
INSERT INTO peoples (
    id,name ,status,email ,phone_number,course_id
) VALUES
(1,'Sarah' ,'Training','s@spartaglobal.com','07837019346','c3'),
(2,'Joe','Pre-assignment','j@spartaglobal.com','07358108572','c1'),
(3,'Bill','Placement','b@spartaglobal.com','07529671926','c2');

Create clients table

In [ ]:
DROP TABLE IF EXISTS clients 
CREATE TABLE clients (
    id VARCHAR(225) PRIMARY KEY,
    name VARCHAR(225),
    people_id INT FOREIGN KEY REFERENCES peoples(id)
);

Insert values into clients table

In [16]:
INSERT INTO clients (
    id,name,people_id
) VALUES 
('cl1','Barclays',3),
('cl2','Apple',NULL),
('cl3','Tesco',NULL);